{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<sos>": 2,
      "<eos>": 3,
      "C": 4,
      "=": 5,
      "(": 6,
      ")": 7,
      "O": 8,
      "N": 9,
      "1": 10,
      "2": 11,
      "[": 12,
      "]": 13,
      "c": 14,
      "3": 15,
      "H": 16,
      "@": 17,
      "F": 18,
      "S": 19,
      "4": 20,
      "l": 21,
      "/": 22,
      "5": 23,
      "B": 24,
      "n": 25,
      "R": 26,
      "$": 27,
      "M": 28,
      "r": 29,
      "P": 30,
      "-": 31,
      "6": 32,
      "E": 33,
      "e": 34,
      ".": 35,
      "\\": 36,
      "+": 37,
      "#": 38,
      "7": 39,
      "t": 40,
      "A": 41,
      "h": 42,
      "8": 43,
      "m": 44,
      "u": 45,
      "X": 46,
      "'": 47,
      "Y": 48,
      "9": 49,
      "Z": 50,
      "T": 51,
      "o": 52,
      "i": 53,
      "s": 54,
      "L": 55,
      "I": 56,
      "G": 57,
      "Q": 58,
      "J": 59,
      "0": 60,
      "z": 61,
      "b": 62,
      "a": 63,
      "y": 64,
      "k": 65,
      "V": 66,
      "W": 67,
      "x": 68,
      "d": 69,
      "p": 70,
      "q": 71,
      "U": 72,
      "w": 73,
      "j": 74,
      "v": 75,
      "g": 76,
      "f": 77,
      "%": 78,
      "K": 79,
      ":": 80,
      "D": 81,
      "*": 82
    },
    "unk_token": "<unk>"
  }
}